ymaps.ready(init3);

function init3() {
  let arrCords = [
    [41.275548, 69.204386],
    [41.321113, 69.23748],
    [41.326555, 69.330215],
    [41.286622, 69.152228],
    [41.246658, 69.166917],
    [41.365991, 69.289968],
    [41.344297, 69.20479],
    [41.223774, 69.221325],
    [41.304416, 69.246818],
    [41.305422, 69.305834],
    [41.31947, 69.281969],
    [41.292003, 69.285304],
    [41.284987, 69.348649],
    [41.238008, 69.332161],
    [41.327303, 69.195382],
    [41.277128, 69.245196],
    [41.259257, 69.224402],
    [41.355994, 69.250263],
    [41.352745, 69.352803],
  ];

  let arrText = [
    ["Проспект Бунёдкор, 52/2, ориентир: метро Чиланзар"],
    ['ТЦ Ташкент, площадь Чорсу, 3А, напротив магазина "Kitoblar Olami"'],
    ["Мирзо Улугбекский район, остановка Буюк Ипак йули"],
    ["ТКАД, 7А/1, парковка Урикзар"],
    ["ТЦ “Абусахий” Центр, Бунёдкор проспект 156/1, парковка “Абу Сахий”"],
    ['Юнусабадский район, Ахмадониш 47В, парковка "Универсам"'],
    ["Проспект Беруни, 47, парковка Экобозор Беруний"],
    [
      'Улица Янги Сергели, парковка "Райхон Миллий Таомлар", ориентир: напротив “Корзинка”',
    ],
    ['Улица Фурката, парковка "Magic City"'],
    ["Парковка парка Ашхабад"],
    ["“Алайский” рынок, метро Абдуллы Кадыри"],
    [
      "Улица Туркистан, конечная автобусной станции Северного Вокзала, ориентир: метро Ташкент",
    ],
    [
      'Улица Авиасозлар, парковка рынка “Кадышева”, ориентир: напротив кофейни "Rodena"',
    ],
    ['ТКАД, парковка рынка "Куйлюк", ориентир: напротив ТРЦ "Compass"'],
    ['Малая кольцевая дорога, парковка "Oq Tepa Lavash" Gulzor'],
    ['Улица Кушбеги, парковка ресторана "Qanotchi"'],
    ["Улица Усмана Насыра, парковка Южного Вокзала"],
    ['Уста Ширин 124 А, ориентир: рынок Жомий, напротив магазина "AKFA"'],
    ["Проспект Мирзо Улугбека, парковка “Экобазар” Чимган"],
  ];

  var sizeZoom = 12;

  if (window.innerWidth < 768) {
    sizeZoom = 12;
  }

  var myMap = new ymaps.Map(
      "bus_stop_point__map",
      { center: [41.311153, 69.279729], zoom: sizeZoom, controls: [] },
      {
        suppressMapOpenBlock: true,
      }
    ),
    myGeoObject = new ymaps.GeoObject();

  for (let index = 0; index < arrCords.length; index++) {
    const element = arrCords[index];
    const text = arrText[index];

    myMap.geoObjects.add(myGeoObject).add(
      new ymaps.Placemark(
        [element[0], element[1]],
        {
          balloonContentHeader: text[0],
          balloonContentBody: text[1],
        },
        {
          preset: "islands#circleIcon",
          iconCaptionMaxWidth: "30",
          iconColor: "#f2612f",
        }
      )
    );
  }
}
